app/views/dash_admin/compare_user_stats.html.erb

            <% @reviewed_videos.each do |video| %>
                <% if video.turn_rating.present? && video.recorded_pitch.present? && video.recorded_pitch.file.present? %>
---
SELECT  "user_ratings".* FROM "user_ratings" WHERE "user_ratings"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]

};
document.getElementById('chart_gesamt').addEventListener('click', function() {
    $('.active').removeClass('active');
    $('.gesamt').addClass('active');
    var i = 0;
    <% @turns_rating.each.with_index do |g,i| %>
        var json_data = <%= g.to_json.html_safe %>
        json_data["word"] = "<%= g.turn.word.name if g.turn.word.present? && g.turn.present?  %>";
            json_data["id"] = "<%= g.turn.id %>";
            json_data["turn_rating_id"] = "<%= g.id %>";


            <% admin_rating = Rating.where(turn_id: g.id, admin_id: @admin.id).first %>
            <% if admin_rating.present? %>
                var admin_body = <%= admin_rating.body %>;
            <% else %>
                var admin_body = 0;
            <% end %>
            json_data["type"] = "ges"
            json_data["type2"] = "ges2"
            json_data["type_text"] = "Gesment"
            <% if g.turn.recorded_pitch.present? %>
---
SELECT  "turn_ratings".* FROM "turn_ratings" WHERE "turn_ratings"."user_id" = $1 ORDER BY "turn_ratings"."id" DESC LIMIT $2  [["user_id", 2], ["LIMIT", 7]]

        datapoints[i] = {value: <%= g.spontan / 10.0 %>, data: json_data};
        <% if Turn.where(game_id: g.game_id, user_id: @user1.id).count >= 1 %>
            <% rating = TurnRating.where(game_id: g.game_id, user_id: @user1.id).first %>
---
SELECT COUNT(*) FROM "turns" WHERE "turns"."game_id" = $1 AND "turns"."user_id" = $2  [["game_id", 2], ["user_id", 1]]
SELECT  "turn_ratings".* FROM "turn_ratings" WHERE "turn_ratings"."game_id" = $1 AND "turn_ratings"."user_id" = $2 ORDER BY "turn_ratings"."id" ASC LIMIT $3  [["game_id", 2], ["user_id", 1], ["LIMIT", 1]]