app/views/dash_admin/games.html.erb

SELECT "teams".* FROM "teams" WHERE "teams"."admin_id" = $1  [["admin_id", 1]]
---
<script>
document.getElementById('new_team').value='';