app/views/dash_admin/teams.html.erb

                        <td onclick="selectTeam(<%= t.id %>)" id="search" ><%= t.name %></td>
                        <td onclick="selectTeam(<%= t.id %>)"><%= t.users.count %></td>
---
SELECT "teams".* FROM "teams" WHERE "teams"."admin_id" = $1  [["admin_id", 1]]
SELECT COUNT(*) FROM "users" INNER JOIN "team_users" ON "users"."id" = "team_users"."user_id" WHERE "team_users"."team_id" = $1  [["team_id", 1]]