app/views/dash_admin/team_stats.html.erb

SELECT  "game_ratings".* FROM "game_ratings" WHERE "game_ratings"."team_id" = $1 ORDER BY "game_ratings"."id" DESC LIMIT $2  [["team_id", 1], ["LIMIT", 7]]
SELECT  "team_ratings".* FROM "team_ratings" WHERE "team_ratings"."team_id" = $1 LIMIT $2  [["team_id", 1], ["LIMIT", 1]]
---
                    <div class="points">
                       <%=  @user_ratings.first[:rating] / 10.0 %>