app/views/dash_admin/users.html.erb

    })
    $(".edit-user").on("click", function(e){
    e.preventDefault()
    var $id = $(this).data("id")
    var user = $(this).data("user");
    var teams = $(this).data("teams");

    var url = '/users/'+$id+'/update';
    var defaultImgurl = "<%= image_path('defaults/wolf.jpg')%>";
    if(user.avatar.url == null){
    $("#imgPrevedit").attr("src", defaultImgurl)
    }else{
      $("#imgPrevedit").attr("src", user.avatar.url)
    }
    // $(".items").empty()
    selectize[1].selectize.clear()
    teams.forEach(function(team){
      // $("#inputtagsedit").append(`<option value=`+team.id+`" selected>`+ team.name+`</option>`)
      selectize[1].selectize.addItem(team.id)
    })
    $("#edit_company_name").val(user.company_name)
    $("#lname").val(user.lname)
---
SELECT "users".* FROM "users" WHERE "users"."admin_id" = $1  [["admin_id", 1]]