app/views/dash_admin/user_stats.html.erb


    <% if GameRating.where(game_id: g.game_id).first %>
---
SELECT  "game_ratings".* FROM "game_ratings" WHERE "game_ratings"."game_id" = $1 ORDER BY "game_ratings"."id" ASC LIMIT $2  [["game_id", 1], ["LIMIT", 1]]