app/views/dash_admin/user_stats.html.erb

                                <% if u.user_rating %>
                                    <div class="user"><%= link_to (u.fname.present? ? u.fname : '') + ' ' + (u.lname.present? ? u.lname : ''), dash_admin_user_stats_path(u.id) %></div>
---
SELECT "users".* FROM "users" WHERE "users"."admin_id" = $1  [["admin_id", 1]]

                <div id="chart_ges" class="c100 p<%= ges %> center" style="font-size: 10.5vh;">
                    <span class="rating-1"><%= @user_rating.ges.present? ? ((@user_rating.ges / 10.0 == 10.0 ? '10' : (@user_rating.ges / 10.0)))  : '0.0' %></span>
---
SELECT  "user_ratings".* FROM "user_ratings" WHERE "user_ratings"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

                    <div class="points">
                       <%=  @user_ratings.first[:rating] / 10.0 %>
---
SELECT  "turn_ratings".* FROM "turn_ratings" WHERE "turn_ratings"."user_id" = $1 ORDER BY "turn_ratings"."id" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 7]]

function teamSelectUserHide(elem) {
    $(elem).find('.users').hide();
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]