app/views/dash_admin/users.html.erb

SELECT  "teams".* FROM "teams" INNER JOIN "team_users" ON "teams"."id" = "team_users"."team_id" WHERE "team_users"."user_id" = $1 ORDER BY "teams"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
        <tr class="user-row">
           <td onclick="redirect_stats(<%= u.teams.first.id if  u.teams.first.present? %>,<%= u.id %>)"><%= image_tag(u.avatar.quad.url) if u.avatar? %></td>

SELECT COUNT(*) FROM "teams" INNER JOIN "team_users" ON "teams"."id" = "team_users"."team_id" WHERE "team_users"."user_id" = $1  [["user_id", 1]]
SELECT  "turns".* FROM "turns" WHERE "turns"."user_id" = $1 ORDER BY "turns"."id" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "turns" WHERE "turns"."user_id" = $1  [["user_id", 1]]
---
            <td onclick="redirect_stats(<%= u.teams.first.id if  u.teams.first.present? %>,<%= u.id %>)"><%= u.email %></td>
            <td onclick="redirect_stats(<%= u.teams.first.id if  u.teams.first.present? %>,<%= u.id %>)"><%= u.company_name %></td>
            <td onclick="redirect_stats(<%= u.teams.first.id if  u.teams.first.present? %>,<%= u.id %>)"><% if Turn.where(user_id: u.id).count > 0 %><%= Turn.where(user_id: u.id).last.updated_at.strftime('%d.%m.%Y') %><% end %></td>