app/views/game_desktop_admin/bestlist.html.erb

        </div>
        <div class="rating" style="left: calc( <%= @turn_ratings.first.ges %>% - 250px ); animation-name: rat1">
---
SELECT  "game_ratings".* FROM "game_ratings" WHERE "game_ratings"."game_id" = $1 LIMIT $2  [["game_id", 1], ["LIMIT", 1]]
SELECT "turn_ratings".* FROM "turn_ratings" WHERE "turn_ratings"."game_id" = $1 ORDER BY ges desc  [["game_id", 1]]
SELECT AVG("turn_ratings"."ges") FROM "turn_ratings" WHERE "turn_ratings"."game_id" = $1  [["game_id", 1]]