app/views/game_desktop_admin/choose.html.erb

            <% else %>
            <% if !User.find_by(id: t.user_id).avatar.nil? %>
               <div class='pic' id="pic<%= i %>">
                <%= image_tag User.find_by(id: t.user_id).avatar.quad.url %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]