app/views/game_mobile_user/rating.html.erb

<script>
    $(document).ready(
        function() {
            setInterval(function() {
                if($('#redirect').text().trim() == 'rating') {
                    $('#redirect').load('rating #redirect');
                } else if($('#redirect').text().trim() == 'turn') {
                    window.location.replace('<%= gmu_turn_path %>');
                } else if($('#redirect').text().trim() == 'bestlist') {
                    window.location.replace('<%= gmu_bestlist_path %>');
                } else if($('#redirect').text().trim() == 'replay') {
                    window.location.replace('<%= gmu_replay_path(@user, @game) %>');
                } else if($('#redirect').text().trim() == 'ended') {
                    window.location.replace('<%= gmu_ended_path(@user, @game) %>');
                } else {
                    window.location.replace('<%= gmu_choose_path %>');
                }
            }, 2000);
        }
    );
---
SELECT  "user_ratings".* FROM "user_ratings" WHERE "user_ratings"."user_id" = $1 LIMIT $2  [["user_id", 9], ["LIMIT", 1]]