app/views/backoffice/words.html.erb

				<td onclick="redirect(<%= g.id %>)"><%= g.created_at.strftime('%d.%m.%Y') %></td>
				<td onclick="redirect(<%= g.id %>)"><%= g.words.count %></td>
---
SELECT "words".* FROM "words"