app/helpers/database_helper.rb

SELECT  "turn_ratings".* FROM "turn_ratings" WHERE "turn_ratings"."turn_id" = $1 LIMIT $2  [["turn_id", 30], ["LIMIT", 1]]
UPDATE "user_ratings" SET "ges" = $1, "body" = $2, "creative" = $3, "spontan" = $4, "updated_at" = $5 WHERE "user_ratings"."id" = $6  [["ges", 59], ["body", 65], ["creative", 63], ["spontan", 60], ["updated_at", "2019-03-27 11:06:49.138346"], ["id", 1]]
SELECT  "turn_ratings".* FROM "turn_ratings" WHERE "turn_ratings"."turn_id" = $1 LIMIT $2  [["turn_id", 4], ["LIMIT", 1]]
SELECT AVG("ratings"."rhetoric") FROM "ratings" WHERE "ratings"."turn_id" = $1  [["turn_id", 4]]
SELECT  "game_ratings".* FROM "game_ratings" WHERE "game_ratings"."game_id" = $1 LIMIT $2  [["game_id", 25], ["LIMIT", 1]]
SELECT  "user_ratings".* FROM "user_ratings" WHERE "user_ratings"."user_id" = $1 LIMIT $2  [["user_id", 8], ["LIMIT", 1]]
INSERT INTO "turn_ratings" ("turn_id", "game_id", "admin_id", "ges", "body", "creative", "rhetoric", "spontan", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT AVG("ratings"."rhetoric") FROM "ratings" WHERE "ratings"."turn_id" = $1  [["turn_id", 30]]
---
  def update_turn_rating_old(turn)
    @ratings = turn.ratings.all
    if TurnRating.find_by(turn_id: turn.id)
      TurnRating.find_by(turn_id: turn.id).update(ges: @ratings.average(:ges), body: @ratings.average(:body), creative: @ratings.average(:creative), rhetoric: @ratings.average(:rhetoric), spontan: @ratings.average(:spontan))
    else
      TurnRating.create(turn_id: turn.id, admin_id: turn.admin_id, user_id: turn.user_id, game_id: turn.game_id, ges: @ratings.average(:ges), body: @ratings.average(:body), creative: @ratings.average(:creative), rhetoric: @ratings.average(:rhetoric), spontan: @ratings.average(:spontan))

UPDATE "team_ratings" SET "ges" = $1, "body" = $2, "creative" = $3, "rhetoric" = $4, "spontan" = $5, "updated_at" = $6 WHERE "team_ratings"."id" = $7  [["ges", 31], ["body", 31], ["creative", 31], ["rhetoric", 31], ["spontan", 31], ["updated_at", "2019-03-20 10:07:31.769865"], ["id", 1]]
INSERT INTO "game_ratings" ("game_id", "team_id", "ges", "body", "creative", "rhetoric", "spontan", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "team_ratings" ("team_id", "ges", "body", "creative", "rhetoric", "spontan", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["team_id", 1], ["ges", 50], ["body", 50], ["creative", 50], ["rhetoric", 50], ["spontan", 50], ["created_at", "2019-03-26 15:53:16.095672"], ["updated_at", "2019-03-26 15:53:16.095672"]]
---
  def update_turn_rating(turn, custom_rating)
    @custom_ratings_criteria = turn.custom_rating_criteria.all
    @turn_rating_criteria = TurnRatingCriterium.find_by(turn_id: turn.id)
    ratings_avg = {}
    custom_rating.rating_criteria.each do |rating|
      rating_value_hash = @custom_ratings_criteria.find_by(name: rating[:name]).attributes.slice('value')
      avg = rating_value_hash.values.inject(0, :+) / rating_value_hash.length
      ratings_avg[rating[:name]] = avg
    end
    rating_value_hash = @custom_ratings_criteria.find_by(name: 'ges').attributes.slice('value')
    avg = rating_value_hash.values.inject(0, :+) / rating_value_hash.length
    ges_avg = avg


    if @turn_rating_criteria
      ratings_avg.each do |key, value|
        @turn_rating_criteria.find_by(name: key).update(value: value)
      end
      @turn_rating_criteria.find_by(name: 'ges').update(value: ges_avg)

      # @turn_rating_criteria.update(ges: @ratings.average(:ges), body: @ratings.average(:body), creative: @ratings.average(:creative), rhetoric: @ratings.average(:rhetoric), spontan: @ratings.average(:spontan))
    else
      ratings_avg.each do |key, value|
        # @turn_rating_criteria.find_by(name: key).update(value: value)
        rating_criteria = custom_rating.rating_criteria.find_by(name: key)
        TurnRatingCriterium.create(rating_criteria_id: rating_criteria.id,turn_id: turn.id, admin_id: turn.admin.id, user_id: turn.user_id, game_id: turn.game_id, name: key, value: value)