app/helpers/root_session_helper.rb

  def current_root
    @current_root ||= Root.find_by(id: session[:root_id])
---
SELECT  "roots".* FROM "roots" WHERE "roots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]