app/controllers/backoffice_controller.rb

SELECT "words".* FROM "words"
---
  def words
    @words = @basket.words.all