app/controllers/backoffice_controller.rb

  def set_root
    @root = Root.find(params[:root_id])
---
SELECT  "roots".* FROM "roots" WHERE "roots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]