app/controllers/dash_admin_controller.rb

SELECT  "game_ratings".* FROM "game_ratings" WHERE "game_ratings"."team_id" = $1 ORDER BY "game_ratings"."id" DESC LIMIT $2  [["team_id", 1], ["LIMIT", 7]]
SELECT  "team_ratings".* FROM "team_ratings" WHERE "team_ratings"."team_id" = $1 LIMIT $2  [["team_id", 1], ["LIMIT", 1]]
---
  def team_stats
    @users = @admin.users
    @rating = @team.team_rating
    @gameratings = @team.game_ratings.last(7)
    @count = 1
    if !@rating
      flash[:pop_up] = "Ups, für dieses Team liegen noch keine Statistiken vor.;- Da müsst ihr wohl erst noch eine Runde spielen. -;Let's Play"
      redirect_to dash_admin_teams_path
    end

    userss = @team.users.select(%Q"#{Turn::TURN_QUERY}").includes(:turn_ratings, :turns).distinct

SELECT  "turn_ratings".* FROM "turn_ratings" WHERE "turn_ratings"."user_id" = $1 ORDER BY "turn_ratings"."id" DESC LIMIT $2  [["user_id", 2], ["LIMIT", 7]]
---
  def compare_user_stats
    @users = @admin.users
    @turns = @user.turns
    @turns_rating = @user.turn_ratings.last(7)