app/controllers/dash_admin_controller.rb

SELECT "teams".* FROM "teams" WHERE "teams"."admin_id" = $1  [["admin_id", 1]]
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 ORDER BY "games"."id" ASC LIMIT $2  [["id", 25], ["LIMIT", 1]]
---
  def index
    @users = @admin.users
    if params[:team_id]
      @team = Team.find(params[:team_id])
    end
	if params[:game_id]
	  @game = Game.find(params[:game_id])

SELECT "teams".* FROM "teams" WHERE "teams"."admin_id" = $1  [["admin_id", 1]]
---
  def teams
    if params[:team_id]
      @team = Team.find(params[:team_id])

SELECT "users".* FROM "users" WHERE "users"."admin_id" = $1  [["admin_id", 1]]
SELECT  "user_ratings".* FROM "user_ratings" WHERE "user_ratings"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  "user_ratings".* FROM "user_ratings" WHERE "user_ratings"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
SELECT  "turn_ratings".* FROM "turn_ratings" WHERE "turn_ratings"."user_id" = $1 ORDER BY "turn_ratings"."id" DESC LIMIT $2  [["user_id", 2], ["LIMIT", 7]]
---
  def user_stats
    if @user.turns.count == 0 || !@user.user_rating_criteria.present?
      flash[:pop_up] = 'Der Spieler hat noch keine Statisiken!'
      redirect_to dash_admin_teams_path
      return
    end
    @users = @admin.users.all
    @turns = @user.turns.all
    @user_rating_criteria = @user.user_rating_criteria.order('LOWER(name) ASC')
    @turn_ratings = @user.turn_rating_criteria
    @date = @turn_ratings.first&.created_at&.beginning_of_day

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "user_ratings".* FROM "user_ratings" WHERE "user_ratings"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
---
  def compare_user_stats
    @users = @admin.users
    @turns = @user.turns
    @turns_rating = @user.turn_ratings
    @user1 = User.find(params[:compare_user_id])
    @reviewed_videos = @turns.where.not(recorded_pitch: nil).order('created_at DESC')
    @turns_rating2 = @user1.turn_ratings
    if !@turns_rating2.present? && !@turns_rating.present?

SELECT "users".* FROM "users" WHERE "users"."admin_id" = $1  [["admin_id", 1]]
---
    def find_index_and_siblings(result, user_id)
      index = result.index{|record| record if record[:user].id == user_id.to_i}
      index = result.index{|record| record if record[:user].id == user_id.to_i} if index.nil?
      if index.nil?
        current_user = result.first

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_team
      @team = Team.find(params[:team_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
    def set_user
      @user = User.find(params[:user_id])