app/controllers/game_desktop_admin_controller.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def turn
    @turns = @game.turns.where(status: 'accepted').playable
    if @game.state != 'turn' && @turns.count == 1
      @turn = @turns.first
      @user = @turn.findUser
      @game.update(state: 'turn', active: false, current_turn: @game.turns.where(status: "accepted").playable.first.id)
    elsif @game.state != 'turn'
      @turn1 = Turn.find_by(id: @game.turn1)
      @turn2 = Turn.find_by(id: @game.turn2)
      if @turn1.counter > @turn2.counter
		@game.update(state: 'turn', current_turn: @turn1.id)
      else
        @game.update(state: 'turn', current_turn: @turn2.id)
      end
	  ActionCable.server.broadcast "game_#{@game.id}_channel",game_state: "turn", game_admin_id: @game.admin_id
    end
    @turn1 = Turn.find_by(id: @game.turn1)
    @turn2 = Turn.find_by(id: @game.turn2)
    @turn = Turn.find_by(id: @game.current_turn)
    @user = @turn.findUser

    if @game.rating_option == 2 || @game.rating_option == 1
      @current_turn = Turn.find(@game.current_turn)
      if @current_turn.custom_rating_criteria.present?
        unless TurnRatingCriterium.where(turn_id: @current_turn.id).present?
          @current_user = @current_turn.findUser

SELECT  "user_ratings".* FROM "user_ratings" WHERE "user_ratings"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  "turn_ratings".* FROM "turn_ratings" WHERE "turn_ratings"."turn_id" = $1 LIMIT $2  [["turn_id", 30], ["LIMIT", 1]]
INSERT INTO "user_ratings" ("user_id", "ges", "body", "creative", "rhetoric", "spontan", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["user_id", 1], ["ges", 50], ["body", 50], ["creative", 50], ["rhetoric", 50], ["spontan", 50], ["created_at", "2019-03-26 15:52:37.581690"], ["updated_at", "2019-03-26 15:52:37.581690"]]
---
  def rating
    @custom_rating = @game.custom_rating
    if @game.rating_user_id.present?
      if @game.state != 'rating'
        @turn.update(played: true)
        @game.update(state: 'rating')
      end
    else
      @disabled_ratings_count = @turn.custom_rating_criteria.where(disabled: false).where.not(rating_criteria_id: nil).count / @custom_rating.rating_criteria.count
      if @game.state != 'rating' && @disabled_ratings_count == 0
        @turn.update(status: 'ended')
        redirect_to gda_after_rating_path
        return
      elsif @game.state != 'rating'
        @turn.update(played: true)
        @game.update(state: 'rating')
      end
    end
    update_turn_rating(@turn, @custom_rating)
    if @user != @admin
      update_user_rating(@user, @custom_rating, @game)
    end
    if @game.rating_user_id.present?
      @turn_rating_copy = User.find(@game.rating_user_id).custom_rating_criteria.where(game_id: @game.id, turn_id: @turn.id)
      @turn_rating = []
      @turn_rating_copy.each do |tr|
        @turn_rating << tr if tr.name != 'ges'