app/controllers/game_mobile_admin_controller.rb

  def new
    session[:admin_email] = nil
    @game = Game.where(password: params[:password], active: true).first
---
SELECT  "games".* FROM "games" WHERE "games"."password" = $1 AND "games"."active" = $2 ORDER BY "games"."id" ASC LIMIT $3  [["password", "aaa"], ["active", true], ["LIMIT", 1]]

  def create
    @game = Game.where(password: params[:password], active: true).first
    if @game
      session[:game_session_id] = @game.id
      sign_in(@game)
      @admin = Admin.where(id: @game.admin_id, email: session[:admin_email].downcase).first
---
SELECT  "games".* FROM "games" WHERE "games"."password" = $1 AND "games"."active" = $2 ORDER BY "games"."id" ASC LIMIT $3  [["password", "aaa"], ["active", true], ["LIMIT", 1]]
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = $1 AND "admins"."email" = $2 ORDER BY "admins"."id" ASC LIMIT $3  [["id", 1], ["email", "jan.resing@gmail.com"], ["LIMIT", 1]]
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new_avatar
    @game = Game.find(session[:game_session_id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update_game_seconds
    @game = Game.find(session[:game_session_id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 ORDER BY "games"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create_avatar
    @game = Game.find(session[:game_session_id])
    @admin.update(avatar: params[:admin][:avatar])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "admins" SET "avatar" = $1, "updated_at" = $2 WHERE "admins"."id" = $3  [["avatar", "1832.jpg"], ["updated_at", "2019-03-26 15:51:54.241302"], ["id", 1]]

  def new_turn
    @game = Game.find(session[:game_session_id])
    @turn = @game.turns.find_by(admin_id: @admin.id, admin_turn: true)
    @turn.update(status: 'ended') if @turn.present?
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "turns".* FROM "turns" WHERE "turns"."game_id" = $1 AND "turns"."admin_id" = $2 LIMIT $3  [["game_id", 1], ["admin_id", 1], ["LIMIT", 1]]
SELECT "turns".* FROM "turns" WHERE "turns"."game_id" = $1  [["game_id", 1]]
UPDATE "games" SET "state" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["state", "wait"], ["updated_at", "2019-03-26 15:51:59.580251"], ["id", 1]]

  def create_turn
    @game = Game.find(session[:game_session_id])
    if @game.own_words
      @word = @game.catchword_basket.words.sample(5).first if !@game.catchword_basket.nil?
      @word = Word.all.sample(5).first if @word.nil?
    else
      @word = Word.all.sample(5).first
    end
    @turn = Turn.new(play: params[:turn][:play], admin_id: @admin.id, game_id: @game.id, word_id: @word.id, played: false, status: "accepted", admin_turn: true)
    if @turn.save
      @game.catchword_basket.words.delete(@word) if @game.uses_peterwords && @game.catchword_basket.present? && @game.catchword_basket.words.include?(@word)
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 ORDER BY "games"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "words".* FROM "words" WHERE "words"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "turns" ("game_id", "word_id", "admin_id", "play", "played", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["game_id", 1], ["word_id", 1], ["admin_id", 1], ["play", true], ["played", false], ["created_at", "2019-03-26 15:51:57.922558"], ["updated_at", "2019-03-26 15:51:57.922558"]]
SELECT "turns".* FROM "turns" WHERE "turns"."game_id" = $1 AND "turns"."play" = $2 AND "turns"."played" = $3  [["game_id", 1], ["play", true], ["played", false]]

  def wait
    if @game.state == 'intro' || @game.state == 'replay'
      @game.update(state: 'wait')
---
UPDATE "games" SET "state" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["state", "rate"], ["updated_at", "2019-03-27 11:11:09.086929"], ["id", 3]]

  def choose
    @turns = @game.turns.where(status: "accepted").playable.sample(100)
    if @game.state != 'choose' && @turns.count == 1
      redirect_to gea_mobile_path
      return
    elsif  @game.state != 'choose' && @turns.count == 0
---
SELECT COUNT(*) FROM "turns" WHERE "turns"."game_id" = $1  [["game_id", 1]]

  def turn
    if @game.state != 'turn' && @game.turns.where(status: "accepted").playable.count == 1
      @turn = @game.turns.where(status: "accepted").playable.first
      @game.update(state: 'turn', active: false, current_turn: @game.turns.playable.first.id)
---
UPDATE "games" SET "state" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["state", "rating"], ["updated_at", "2019-03-26 15:52:34.928471"], ["id", 1]]

  def play
    @record =  params[:video] == "record" ? true : false
    if @game.state != 'play'
      @game.update(state: 'play')
---
UPDATE "games" SET "state" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["state", "play"], ["updated_at", "2019-03-27 11:11:06.655423"], ["id", 3]]

  def rate
    if @game.state != 'rate'
      @game.update(state: 'rate')
    end
    if @turn.ratings.find_by(admin_id: @admin.id)
---
UPDATE "games" SET "state" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["state", "bestlist"], ["updated_at", "2019-03-27 11:11:18.667267"], ["id", 3]]
SELECT  "ratings".* FROM "ratings" WHERE "ratings"."turn_id" = $1 AND "ratings"."admin_id" = $2 LIMIT $3  [["turn_id", 1], ["admin_id", 1], ["LIMIT", 1]]

  def rating
    if @game.state != 'rating' && @turn.ratings.count == 0
      @turn.update(status: "ended")
---
SELECT COUNT(*) FROM "ratings" WHERE "ratings"."turn_id" = $1  [["turn_id", 1]]
UPDATE "user_ratings" SET "ges" = $1, "body" = $2, "creative" = $3, "spontan" = $4, "updated_at" = $5 WHERE "user_ratings"."id" = $6  [["ges", 55], ["body", 57], ["creative", 53], ["spontan", 60], ["updated_at", "2019-03-27 11:11:16.121153"], ["id", 3]]
UPDATE "games" SET "state" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["state", "ended"], ["updated_at", "2019-03-26 15:53:26.639886"], ["id", 1]]

  def bestlist
    if @game.state != 'bestlist'
      @game.update(state: 'bestlist')
---
UPDATE "games" SET "state" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["state", "bestlist"], ["updated_at", "2019-03-27 11:11:18.667267"], ["id", 3]]

  def ended
    @game = current_game
    if @game.state != 'ended'
      @game.update(state: 'ended', active: false)
---
UPDATE "games" SET "state" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["state", "ended"], ["updated_at", "2019-03-26 15:53:26.639886"], ["id", 1]]

    def set_game
      @game = current_game
      @team = Team.find(@game.team_id)
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def set_turn
      @turn = Turn.find_by(id: @game.current_turn)
      @cur_user = @turn.findUser if @turn
---
SELECT  "turns".* FROM "turns" WHERE "turns"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]