app/controllers/game_mobile_user_controller.rb

  def new
    #Todo: sometimes session give nil value
    unless session[:game_session_id].present?
      redirect_to request.referer
      return
    end
    @game1 = Game.find(session[:game_session_id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]

  def create
    @game1 = Game.find(session[:game_session_id])
    if @game1
      @admin = Admin.find(@game1.admin_id)
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

        @user = @admin.users.new(email: params[:user][:email])
        @user.password = random_pass
        @user.save!
		    @team = Team.find_by(id: @game1.team_id)
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def accept_user
    Stripe.api_key = 'sk_test_zPJA7u8PtoHc4MdDUsTQNU8g'

    @user = User.where(id: params[:user_id]).first
    @admin = Admin.find(@game.admin_id)
    session[:user_already] = true
    a =8.85*100
    month =a.to_i
    if @admin.plan_type.eql?('trial')
      @user.update_attributes(status: 0)
      create_turn_against_user(@user, @admin, "accepted")
      # return
      ActionCable.server.broadcast  "count_#{@game1.id}_channel", count: 'true', counter: @game.turns.where(status: "accepted").playable.count.to_s, modal: false, new: 'true', user_id: params[:user_id], user_pic: @user.avatar.quad.url
      respond_to do |format|
        format.js {render :js => "$('#myModalAction#{params[:user_id]}').hide()"}
        format.html {redirect_back(fallback_location: root_path) and return}
      end
      return
    elsif @admin.plan_users?
      @user.update_attributes(status: 'accepted')
      create_turn_against_user(@user, @admin, "accepted")
      ActionCable.server.broadcast  "count_#{@game1.id}_channel", count: 'true', counter: @game.turns.where(status: "accepted").playable.count.to_s, modal: false,new: 'true', user_id: params[:user_id], new: 'true', user_pic: @user.avatar.quad.url
      if((@game.turns.select{|turn| turn if !turn.user.nil? && turn.user.accepted?}.count) > @admin.plan_users )
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "turns".* FROM "turns" WHERE "turns"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]

  def bestlist
    if @game.turn_rating_criteria.where(user_id: @user.id, name: 'ges', ended: false).present?
---
SELECT  "game_ratings".* FROM "game_ratings" WHERE "game_ratings"."game_id" = $1 LIMIT $2  [["game_id", 25], ["LIMIT", 1]]
SELECT AVG("turn_ratings"."ges") FROM "turn_ratings" WHERE "turn_ratings"."game_id" = $1  [["game_id", 25]]