app/controllers/game_mobile_admin_controller.rb

SELECT  "words".* FROM "words" WHERE "words"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    @game1 = Game.where(password: params[:password], active: true).first
    if @game1
      session[:game_session_id] = @game1.id
      @admin = Admin.where(id: @game1.admin_id, email: session[:admin_email].downcase).first

SELECT  "turn_ratings".* FROM "turn_ratings" WHERE "turn_ratings"."turn_id" = $1 LIMIT $2  [["turn_id", 6], ["LIMIT", 1]]
---
  def rating
    # @game.turns.where(status: 'accepted').count
    @rating = Rating.find_by(turn_id: @turn.id)