app/controllers/games_controller.rb

SELECT  "games".* FROM "games" WHERE "games"."active" = $1 AND "games"."password" = $2 ORDER BY "games"."id" ASC LIMIT $3  [["active", true], ["password", "aaa"], ["LIMIT", 1]]
INSERT INTO "games" ("admin_id", "team_id", "state", "password", "active", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["admin_id", 1], ["team_id", 1], ["state", "intro"], ["password", "aaa"], ["active", true], ["created_at", "2019-03-26 15:50:14.305585"], ["updated_at", "2019-03-26 15:50:14.305585"]]
---
  def create
    @game = Game.where(active: true, password: params[:game][:password]).first
    if params[:game][:team_id].nil?
      flash[:select_team] = 'Wähle ein Team!'
    end
    if params[:game][:password].empty?
      flash[:missing_password] = 'Gib eine Url an!'
    end
    if params[:game][:team_id].nil?
      redirect_to dash_admin_path()
      return
    elsif params[:game][:password].empty?
      redirect_to dash_admin_games_path(params[:game][:team_id])
      return
    end
    if @game && @game.admin_id == @admin.id
      @game.turns.update_all(status: 'ended')
      redirect_to dash_admin_create_game_2_path(@game)
    elsif @game && @game.admin_id != @admin.id
        flash[:pop_up] = "Ups, diese URL ist schon vergeben!;-"
		flash[:pop_up2] = "Sei kreativ und wähle eine andere aus."
        redirect_to dash_admin_games_path(params[:game][:team_id])
    else
      @game = Game.new(admin_id: @admin.id, team_id: params[:game][:team_id], active: true, state: 'intro', password: params[:game][:password])
      if @game.save