app/controllers/game_desktop_admin_controller.rb

UPDATE "games" SET "state" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["state", "wait"], ["updated_at", "2019-03-20 10:06:48.327126"], ["id", 25]]
SELECT COUNT(*) FROM "turns" WHERE "turns"."game_id" = $1  [["game_id", 25]]
---
  def wait
    if @game.state != 'wait'
        @game.update(state: 'wait')
    end
    @count = @game.turns.count

SELECT "turns".* FROM "turns" WHERE "turns"."game_id" = $1  [["game_id", 1]]
UPDATE "games" SET "state" = $1, "active" = $2, "current_turn" = $3, "updated_at" = $4 WHERE "games"."id" = $5  [["state", "choose"], ["active", false], ["current_turn", 1], ["updated_at", "2019-03-26 15:52:09.438307"], ["id", 1]]
---
  def choose
    @turns = @game.turns.playable.sample(100)
    if @game.state != 'choose' && @turns.count == 1
      redirect_to gea_turn_path
      return
    elsif @game.state != 'choose' && @turns.count == 0
      redirect_to gea_turn_path
      return
    elsif @game.state != 'choose'
      if @game.turns.count > 1
        @game.update(active: false, current_turn: @turns.first.id, state: 'choose')

UPDATE "games" SET "state" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["state", "play"], ["updated_at", "2019-03-20 10:06:59.312211"], ["id", 25]]
UPDATE "games" SET "state" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["state", "play"], ["updated_at", "2019-03-26 15:52:17.370670"], ["id", 1]]
---
  def turn
    if @game.state != 'turn' && @game.turns.playable.count == 1
      @turn = @game.turns.playable.first
      @game.update(state: 'turn', active: false, current_turn: @game.turns.playable.first.id)
    elsif @game.state != 'turn'
      @game.update(state: 'turn')

UPDATE "games" SET "state" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["state", "rate"], ["updated_at", "2019-03-26 15:52:21.293375"], ["id", 1]]
---
  def play
    if @game.state != 'play'
      @game.update(state: 'play')

UPDATE "games" SET "state" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["state", "rating"], ["updated_at", "2019-03-20 10:07:11.808908"], ["id", 25]]
---
  def rate
    if @game.state != 'rate'
      @game.update(state: 'rate')

SELECT COUNT(*) FROM "ratings" WHERE "ratings"."turn_id" = $1  [["turn_id", 4]]
UPDATE "games" SET "state" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["state", "rating"], ["updated_at", "2019-03-20 10:07:11.808908"], ["id", 25]]
---
  def rating
    if @game.state != 'rating' && @turn.ratings.count == 0
      @turn.destroy
      redirect_to gda_after_rating_path
      return
    elsif @game.state != 'rating'
      @turn.update(played: true)

UPDATE "games" SET "state" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["state", "bestlist"], ["updated_at", "2019-03-26 15:53:16.038301"], ["id", 1]]
SELECT  "game_ratings".* FROM "game_ratings" WHERE "game_ratings"."game_id" = $1 LIMIT $2  [["game_id", 26], ["LIMIT", 1]]
SELECT "turn_ratings".* FROM "turn_ratings" WHERE "turn_ratings"."game_id" = $1 ORDER BY ges desc  [["game_id", 1]]
SELECT  "turns".* FROM "turns" WHERE "turns"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "turns" SET "place" = $1, "updated_at" = $2 WHERE "turns"."id" = $3  [["place", 1], ["updated_at", "2019-03-26 15:53:16.105374"], ["id", 1]]
---
  def bestlist
    if @game.state != 'bestlist'
      @game.update(state: 'bestlist')
    end
    update_game_rating @game
    update_team_rating @team
    @turn_ratings = @game.turn_ratings.rating_order
    place = 1
    @turn_ratings.each do |t|
        @turn = Turn.find(t.turn_id)
        @turn.update(place: place)

UPDATE "games" SET "state" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["state", "ended"], ["updated_at", "2019-03-27 11:09:00.117703"], ["id", 2]]
---
  def ended
    @game = current_game
    if @game.state != 'ended'
      @game.update(state: 'ended', active: false)

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_vars
      @game = current_game
      @admin = current_admin
      @team = Team.find(@game.team_id)

SELECT  "turns".* FROM "turns" WHERE "turns"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "words".* FROM "words" WHERE "words"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_turn
      @turn = Turn.find(@game.current_turn)
      @user = @turn.findUser
      @word = Word.find(@turn.word_id)