app/controllers/game_mobile_user_controller.rb

SELECT  "ratings".* FROM "ratings" WHERE "ratings"."turn_id" = $1 AND "ratings"."user_id" = $2 LIMIT $3  [["turn_id", 30], ["user_id", 9], ["LIMIT", 1]]
---
  def reject_user
    @user = User.where(id: params[:user_id]).first
    if @user.update_attributes(status: 1)
      @turn = Turn.where(user_id: @user.id).destroy_all
      TurnRating.where(user_id:  @user.id).destroy_all
      TeamUser.where(user_id: @user.id).destroy_all

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def accept_user
    Stripe.api_key = 'sk_test_zPJA7u8PtoHc4MdDUsTQNU8g'

    @user = User.where(id: params[:user_id]).first
    @admin = Admin.find(@game.admin_id)