app/controllers/game_mobile_user_controller.rb

  def new
    @game = Game.where(password: params[:password], active: true).first
---
SELECT  "games".* FROM "games" WHERE "games"."password" = $1 AND "games"."active" = $2 ORDER BY "games"."id" ASC LIMIT $3  [["password", "aaa"], ["active", true], ["LIMIT", 1]]

  def create
    @game = Game.where(password: params[:password], active: true).first
    if @game
      session[:game_session_id] = @game.id
      @admin = Admin.find(@game.admin_id)
      if @admin.email == params[:user][:email].downcase
        redirect_to gma_start_path(params[:password])
        return
      end
      @user = User.find_by(email: params[:user][:email])
      if @user && @user.admin == @admin
        if TeamUser.where(user_id: @user.id, team_id: @game.team_id).count == 0
          TeamUser.create(user_id: @user.id, team_id: @game.team_id)
        end
        sign_in(@user)
        touch @game
        redirect_to gmu_new_avatar_path
      else
        @user = @admin.users.create(email: params[:user][:email])
        TeamUser.create(user_id: @user.id, team_id: @game.team_id)
---
SELECT  "games".* FROM "games" WHERE "games"."password" = $1 AND "games"."active" = $2 ORDER BY "games"."id" ASC LIMIT $3  [["password", "aaa"], ["active", true], ["LIMIT", 1]]
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "aa@pp.de"], ["LIMIT", 1]]
SELECT COUNT(*) FROM "team_users" WHERE "team_users"."user_id" = $1 AND "team_users"."team_id" = $2  [["user_id", 1], ["team_id", 1]]
INSERT INTO "team_users" ("team_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["team_id", 1], ["user_id", 8], ["created_at", "2019-03-20 10:05:37.461708"], ["updated_at", "2019-03-20 10:05:37.461708"]]
INSERT INTO "users" ("admin_id", "created_at", "updated_at", "email") VALUES ($1, $2, $3, $4) RETURNING "id"  [["admin_id", 1], ["created_at", "2019-03-20 10:23:08.423248"], ["updated_at", "2019-03-20 10:23:08.423248"], ["email", "dd@pp.de"]]
INSERT INTO "users" ("admin_id", "created_at", "updated_at", "email") VALUES ($1, $2, $3, $4) RETURNING "id"  [["admin_id", 1], ["created_at", "2019-03-27 11:05:51.004217"], ["updated_at", "2019-03-27 11:05:51.004217"], ["email", "bb@pp.de"]]
INSERT INTO "team_users" ("team_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["team_id", 1], ["user_id", 2], ["created_at", "2019-03-27 11:05:51.020455"], ["updated_at", "2019-03-27 11:05:51.020455"]]

  def reject_user
    @user = User.where(id: params[:user_id]).first
    if @user.update_attributes(status: 1)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "fname" = $1, "lname" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["fname", "Förster"], ["lname", "Fati"], ["updated_at", "2019-03-20 10:27:08.578189"], ["id", 12]]

  def accept_user
    Stripe.api_key = 'sk_test_zPJA7u8PtoHc4MdDUsTQNU8g'

    @user = User.where(id: params[:user_id]).first
    @admin = Admin.find(@game.admin_id)

    a =8.85*100
    month =a.to_i

    if @admin.plan_type.eql?('trial')
      @user.update_attributes(status: 0)
      redirect_back(fallback_location: root_path)  and return
    elsif @admin.plan_users?
      @user.update_attributes(status: 'accepted')
      if((@game.turns.select{|turn| turn if !turn.user.nil? && turn.user.accepted?}.count) > @admin.plan_users )
        if @user.admin.plan_type.eql?("year")
          @admin.update_attributes(plan_users: @admin.plan_users + 1 )
          @user.admin.upgrade_subscription_year(@user)
          redirect_back(fallback_location: root_path)  and return
        elsif @user.admin.plan_type.eql?("month")
          @admin.update_attributes(plan_users: @admin.plan_users + 1 )
          Stripe::Charge.create({
                                    customer:@admin.stripe_id ,
                                    amount: month,
                                    currency: 'eur',
                                    description: 'Charge for PeterPitch  ' + @user.email,
                                })
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "avatar" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["avatar", "223.JPG"], ["updated_at", "2019-03-20 10:27:18.589995"], ["id", 12]]
SELECT  "turns".* FROM "turns" WHERE "turns"."game_id" = $1 AND "turns"."user_id" = $2 LIMIT $3  [["game_id", 26], ["user_id", 11], ["LIMIT", 1]]
INSERT INTO "turns" ("game_id", "word_id", "user_id", "play", "played", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["game_id", 26], ["word_id", 1], ["user_id", 12], ["play", true], ["played", false], ["created_at", "2019-03-20 10:27:23.136057"], ["updated_at", "2019-03-20 10:27:23.136057"]]

  def new_name
    @game = Game.find(session[:game_session_id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create_name
    @game = Game.find(session[:game_session_id])
    @user.update(user_params)
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "fname" = $1, "lname" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["fname", "BB"], ["lname", "Pitch"], ["updated_at", "2019-03-27 11:06:00.180468"], ["id", 2]]

  def new_company
    @game = Game.find(session[:game_session_id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create_company
    @game = Game.find(session[:game_session_id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def new_avatar
    @game = Game.find(session[:game_session_id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create_avatar
    @game = Game.find(session[:game_session_id])
    @user.update(user_params)
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "avatar" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["avatar", "2013-03-14_16.02.37.jpg"], ["updated_at", "2019-03-27 11:06:11.849871"], ["id", 2]]

  def new_turn
    @game = Game.find(session[:game_session_id])
    @turn = @game.turns.find_by(user_id: @user.id)
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "turns".* FROM "turns" WHERE "turns"."game_id" = $1 AND "turns"."user_id" = $2 LIMIT $3  [["game_id", 2], ["user_id", 1], ["LIMIT", 1]]

  def create_turn
    @game = Game.find(session[:game_session_id])
    @word = Word.all.sample(5).first
    @turn = Turn.new(user_id: @user.id, game_id: @game.id, word_id: @word.id, play: params[:turn][:play], played: false)
    if @turn.save
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "words".* FROM "words"
INSERT INTO "turns" ("game_id", "word_id", "user_id", "play", "played", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["game_id", 2], ["word_id", 1], ["user_id", 1], ["play", true], ["played", false], ["created_at", "2019-03-27 11:05:26.191577"], ["updated_at", "2019-03-27 11:05:26.191577"]]

  def wait
    @admin = Admin.find(@game.admin_id)
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def rate
    if @user == @cur_user || @turn.ratings.find_by(user_id: @user.id)
---
SELECT  "ratings".* FROM "ratings" WHERE "ratings"."turn_id" = $1 AND "ratings"."user_id" = $2 LIMIT $3  [["turn_id", 4], ["user_id", 1], ["LIMIT", 1]]

  def bestlist
    @turn_rating = @game.turn_ratings.where(user_id: @user.id).first
---
SELECT  "turn_ratings".* FROM "turn_ratings" WHERE "turn_ratings"."game_id" = $1 AND "turn_ratings"."user_id" = $2 ORDER BY "turn_ratings"."id" ASC LIMIT $3  [["game_id", 2], ["user_id", 1], ["LIMIT", 1]]

    def set_turn
      @turn = Turn.find_by(id: @game.current_turn)
      @cur_user = @turn.findUser
---
SELECT  "turns".* FROM "turns" WHERE "turns"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 9], ["LIMIT", 1]]