app/controllers/game_mobile_admin_controller.rb

  def choose_rating_user
    @turns = @game.turns.where(status: "accepted").playable.sample(2)
    if @game.rating_option != 1 || @turns.count <= 1
      redirect_to gea_mobile_path
      return
    else
      @acc_turns = @game.turns.where(status: "accepted").playable.all
      @game.update(not_played_count: @acc_turns.count)
      @users = []
      @acc_turns.each do |turn|
---
SELECT  "turns".* FROM "turns" WHERE "turns"."game_id" = $1 AND "turns"."admin_id" = $2 LIMIT $3  [["game_id", 1], ["admin_id", 1], ["LIMIT", 1]]

  def save_video
    @game.update(video_uploading: false)
    @game.update(video_uploaded_start: false)
    @turn.recorded_pitch = params[:file]
    @turn.recorded_pitch_duration = params[:duration]
    @turn.save
---
INSERT INTO "turns" ("game_id", "word_id", "admin_id", "play", "played", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["game_id", 1], ["word_id", 1], ["admin_id", 1], ["play", true], ["played", false], ["created_at", "2019-03-26 15:51:57.922558"], ["updated_at", "2019-03-26 15:51:57.922558"]]

  def create
    @game1 = Game.where(password: params[:password], active: true).first
    if @game1
      session[:game_session_id] = @game1.id
      @admin = Admin.where(id: @game1.admin_id, email: session[:admin_email].downcase).first
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def choosen
    if params[:turn_id] == 'turn'
      redirect_to gma_turn_path
      return
    end
    @turn = Turn.find_by(id: params[:turn_id])
---
SELECT  "turns".* FROM "turns" WHERE "turns"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def turn
    @turns = @game.turns.where(status: 'accepted').playable
    if @game.state != 'turn' && @turns.count == 1
      @turn = @turns.first
      @game.update(state: 'turn', active: false, current_turn: @turn.id)
      #Todo: new task
      # @game.update(state: 'turn', current_turn: @turn.id)
    elsif @game.state != 'turn'
      @turn1 = Turn.find_by(id: @game.turn1)
      @turn2 = Turn.find_by(id: @game.turn2)
      if @turn1.counter > @turn2.counter
        @game.update(state: 'turn', current_turn: @turn1.id)
      else
        @game.update(state: 'turn', current_turn: @turn2.id)
      end
    end
    if @game.rating_option == 2
	    ActionCable.server.broadcast "game_#{@game.id}_channel",game_state: "turn", game_admin_id: @game.admin_id
    end
    @cur_user = Turn.find_by(id: @game.current_turn).findUser
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = $1 ORDER BY "admins"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def rated
    @count = @turn.custom_rating_criteria.where.not(rating_criteria_id: nil).count / @game.custom_rating.rating_criteria.count
    @turnCount = @game.turns.where(status: "accepted").count - 1
    if @turn.ratings.count == @turnCount
---
SELECT COUNT(*) FROM "ratings" WHERE "ratings"."turn_id" = $1  [["turn_id", 1]]
SELECT COUNT(*) FROM "turns" WHERE "turns"."game_id" = $1  [["game_id", 1]]