app/controllers/landing_controller.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."vid_token" = $1 ORDER BY "admins"."id" ASC LIMIT $2  [["vid_token", "896fb5e3dbbb705e45330b615b5161"], ["LIMIT", 1]]
UPDATE "admins" SET "fname" = $1, "lname" = $2, "encrypted_password" = $3, "password_confirm" = $4, "updated_at" = $5 WHERE "admins"."id" = $6
---
  def update_admin
    @admin = Admin.where(vid_token: params[:v_id]).first
      if @admin.update(admin_params)

SELECT  "admins".* FROM "admins" WHERE "admins"."vid_token" = $1 ORDER BY "admins"."id" ASC LIMIT $2  [["vid_token", "896fb5e3dbbb705e45330b615b5161"], ["LIMIT", 1]]
UPDATE "admins" SET "updated_at" = $1, "sign_in_count" = $2, "current_sign_in_at" = $3, "last_sign_in_at" = $4, "current_sign_in_ip" = $5, "last_sign_in_ip" = $6 WHERE "admins"."id" = $7
---
  def update_admin_details
    @admin = Admin.where(vid_token: params[:v_id]).first

      if @admin.update(admin_params)

SELECT  "admins".* FROM "admins" WHERE "admins"."vid_token" = $1 ORDER BY "admins"."id" ASC LIMIT $2  [["vid_token", "896fb5e3dbbb705e45330b615b5161"], ["LIMIT", 1]]
---
  def sign_up
    @admin = Admin.where(vid_token: params[:v_id]).first

SELECT  "admins".* FROM "admins" WHERE "admins"."vid_token" = $1 ORDER BY "admins"."id" ASC LIMIT $2  [["vid_token", "896fb5e3dbbb705e45330b615b5161"], ["LIMIT", 1]]
---
  def signup
    @admin = Admin.where(vid_token: params[:v_id]).first