app/controllers/ratings_controller.rb

INSERT INTO "ratings" ("turn_id", "admin_id", "ges", "body", "creative", "rhetoric", "spontan", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @admin = current_game_admin
    @rating = Rating.new(rating_params)
    @rating.turn_id = @turn.id
    @rating.ges = (@rating.body + @rating.creative + @rating.rhetoric + @rating.spontan) / 4
    @rating.admin_id = @admin.id
    if @rating.save

INSERT INTO "ratings" ("turn_id", "user_id", "ges", "body", "creative", "rhetoric", "spontan", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create_user
    @user = current_game_user
    @rating = Rating.new(rating_params)
    @rating.turn_id = @turn.id
    @rating.ges = (@rating.body + @rating.creative + @rating.rhetoric + @rating.spontan) / 4
    @rating.user_id = @user.id
    if @rating.save

SELECT  "turns".* FROM "turns" WHERE "turns"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
UPDATE "turns" SET "played" = $1, "updated_at" = $2 WHERE "turns"."id" = $3  [["played", true], ["updated_at", "2019-03-20 10:07:09.370590"], ["id", 30]]
---
    def set_vars
      @turn = Turn.find_by(id: params[:turn_id])
      @turn.update(played: true)