app/controllers/teams_controller.rb

  def create_game
    @team = @admin.teams.new(team_params)
    if @team.save
---
INSERT INTO "teams" ("admin_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["admin_id", 1], ["name", "TEAM ALPHA"], ["created_at", "2019-03-26 15:50:11.247712"], ["updated_at", "2019-03-26 15:50:11.247712"]]