app/controllers/verification_controller.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."vid_token" = $1 ORDER BY "admins"."id" ASC LIMIT $2  [["vid_token", "896fb5e3dbbb705e45330b615b5161"], ["LIMIT", 1]]
---
    def token
        @admin =Admin.where(vid_token: params[:token]).first

SELECT  "admins".* FROM "admins" WHERE "admins"."token" = $1 ORDER BY "admins"."id" ASC LIMIT $2  [["token", 106307], ["LIMIT", 1]]
---
    def verify_token
        @admin =Admin.where(token: params[:token]).first