app/controllers/words_controller.rb

  def create
    @word = Word.create(word_params)
    @word.name = @word.sound_identifier.remove('.mp3')
    @word.free = false
    if @word.save
---
INSERT INTO "words" ("sound", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["sound", "AnanasKnüppel.mp3"], ["created_at", "2019-03-26 15:51:16.676965"], ["updated_at", "2019-03-26 15:51:16.676965"]]
UPDATE "words" SET "name" = $1, "updated_at" = $2 WHERE "words"."id" = $3  [["name", "AnanasKnüppel"], ["updated_at", "2019-03-26 15:51:16.682389"], ["id", 1]]

  def update
    if @word.update(word_params)
---
UPDATE "words" SET "free" = $1, "updated_at" = $2 WHERE "words"."id" = $3  [["free", true], ["updated_at", "2019-03-26 15:51:19.051545"], ["id", 1]]

    def set_word
      @word = Word.find(params[:word_id])
---
SELECT  "words".* FROM "words" WHERE "words"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]