app/models/admin.rb

UPDATE "admins" SET "updated_at" = $1, "stripe_id" = $2, "plan_type" = $3 WHERE "admins"."id" = $4  [["updated_at", "2019-03-26 15:49:34.417113"], ["stripe_id", "cus_ElpBbddHgxjWx4"], ["plan_type", 2], ["id", 1]]
---
  def create_stripe_customer
Stripe.api_key = 'sk_test_zPJA7u8PtoHc4MdDUsTQNU8g'

    customer = Stripe::Customer.create(
      :email => self.email,
    )
    self.stripe_id =  customer.id
    self.plan_type= "trial"
    self.save