app/controllers/devise_user/sessions_controller.rb

  def create
    if !params[:admin][:email].nil? && !params[:admin][:password].nil?
      self.resource = warden.authenticate(auth_options)
      user = User.find_by_email(params[:admin][:email])
      if  !self.resource.nil?
        if !((Date.today.to_s).eql?(self.resource.expiration.to_s))
          set_flash_message!(:notice, :signed_in)
          sign_in(resource_name, resource)
          yield resource if block_given?
          return  render json: {response: "ok"} if request.xhr?
          respond_with resource, location: after_sign_in_path_for(resource)
        else
          redirect_to price_path
        end
      elsif user && user.encrypted_pw && (user.decrypt(user.encrypted_pw) == params[:admin][:password])
        set_flash_message!(:notice, :signed_in)
        sign_in(user)
        return  render json: {response: "ok", user: true} if request.xhr?

        return redirect_to dash_user_stats_url
      else
        email = Admin.find_by_email(params[:admin][:email])
        errors = {}
        errors.merge!({email: true}) if !email.present?
---
SELECT  "admins".* FROM "admins" WHERE "admins"."email" = $1 ORDER BY "admins"."id" ASC LIMIT $2  [["email", "jan.resing@gmail.com"], ["LIMIT", 1]]
SELECT  1 AS one FROM "admins" WHERE "admins"."email" = $1 LIMIT $2  [["email", "jan.resing@gmail.com"], ["LIMIT", 1]]

          if user
            errors = {}
            errors.merge!({email: true}) if !user.present?
            errors.merge!({password:  true}) if user.present? && !(user.encrypt(params[:admin][:password]) == user.encrypted_pw)
---
SELECT  1 AS one FROM "admins" WHERE "admins"."email" = $1 LIMIT $2  [["email", "jan.resing@gmail.com"], ["LIMIT", 1]]
SELECT  "admins".* FROM "admins" WHERE "admins"."email" = $1 ORDER BY "admins"."id" ASC LIMIT $2  [["email", "jan.resing@gmail.com"], ["LIMIT", 1]]

        @admin.token=  (SecureRandom.random_number(9e5) + 1e5).to_i
        @admin.vid_token= SecureRandom.hex(15)
        @admin.skip_confirmation!
        @admin.save
---
INSERT INTO "admins" ("created_at", "updated_at", "email", "encrypted_password", "confirmed_at", "token", "vid_token") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
UPDATE "admins" SET "updated_at" = $1, "stripe_id" = $2, "plan_type" = $3 WHERE "admins"."id" = $4  [["updated_at", "2019-03-26 15:49:34.417113"], ["stripe_id", "cus_ElpBbddHgxjWx4"], ["plan_type", 2], ["id", 1]]