app/controllers/devise_user/sessions_controller.rb

        @admin.token=  (SecureRandom.random_number(9e5) + 1e5).to_i
        @admin.vid_token= SecureRandom.hex(15)
        @admin.skip_confirmation!
        @admin.save
---
INSERT INTO "admins" ("created_at", "updated_at", "email", "encrypted_password", "confirmed_at", "token", "vid_token") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"